Masmiseim36/Coremark_iMXRT/boards/1160/board.h
/*
 * Copyright 2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _BOARD_H_
#define _BOARD_H_

#include "clock_config.h"
#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_clock.h"
#include "config.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/*! @brief The board name */
#ifndef BOARD_NAME
	#define BOARD_NAME "MIMXRT1160-EVK"
#endif
#ifndef DEBUG_CONSOLE_UART_INDEX
	#define DEBUG_CONSOLE_UART_INDEX 1
#endif
#ifndef EXAMPLE_CAN_INDEX
	#define EXAMPLE_CAN_INDEX 3
#endif

/* The UART to use for debug messages. */
#define BOARD_DEBUG_UART_TYPE     kSerialPort_Uart
#define BOARD_DEBUG_UART_CLK_FREQ 24000000

#if DEBUG_CONSOLE_UART_INDEX == 1
	#define BOARD_DEBUG_UART_BASEADDR (uint32_t) LPUART1
	#define BOARD_DEBUG_UART_INSTANCE 1U
	#define BOARD_UART_IRQ            LPUART1_IRQn
	#define BOARD_UART_IRQ_HANDLER    LPUART1_IRQHandler
	#define BOARD_UART_TX_PIN         IOMUXC_GPIO_AD_24_LPUART1_TXD
	#define BOARD_UART_RX_PIN         IOMUXC_GPIO_AD_25_LPUART1_RXD
#elif DEBUG_CONSOLE_UART_INDEX == 2
	#define BOARD_DEBUG_UART_BASEADDR (uint32_t) LPUART2
	#define BOARD_DEBUG_UART_INSTANCE 2U
	#define BOARD_UART_IRQ            LPUART2_IRQn
	#define BOARD_UART_IRQ_HANDLER    LPUART2_IRQHandler
	#define BOARD_UART_TX_PIN         IOMUXC_GPIO_DISP_B2_10_LPUART2_TXD
	#define BOARD_UART_RX_PIN         IOMUXC_GPIO_DISP_B2_11_LPUART2_RXD
#elif DEBUG_CONSOLE_UART_INDEX == 6
	#define BOARD_DEBUG_UART_BASEADDR (uint32_t) LPUART6
	#define BOARD_DEBUG_UART_INSTANCE 6U
	#define BOARD_UART_IRQ            LPUART6_IRQn
	#define BOARD_UART_IRQ_HANDLER    LPUART6_IRQHandler
	#define BOARD_UART_TX_PIN         IOMUXC_GPIO_EMC_B1_40_LPUART6_TXD
	#define BOARD_UART_RX_PIN         IOMUXC_GPIO_EMC_B1_41_LPUART6_RXD
#elif DEBUG_CONSOLE_UART_INDEX == 11
	#define BOARD_DEBUG_UART_BASEADDR (uint32_t) LPUART11
	#define BOARD_DEBUG_UART_INSTANCE 11U
	#define BOARD_UART_IRQ            LPUART11_IRQn
	#define BOARD_UART_IRQ_HANDLER    LPUART11_IRQHandler
	#define BOARD_UART_TX_PIN         IOMUXC_GPIO_LPSR_04_LPUART11_TXD
	#define BOARD_UART_RX_PIN         IOMUXC_GPIO_LPSR_05_LPUART11_RXD
#elif DEBUG_CONSOLE_UART_INDEX == 12
	#define BOARD_DEBUG_UART_BASEADDR (uint32_t) LPUART12
	#define BOARD_DEBUG_UART_INSTANCE 12U
	#define BOARD_UART_IRQ            LPUART12_IRQn
	#define BOARD_UART_IRQ_HANDLER    LPUART12_IRQHandler
	#define BOARD_UART_TX_PIN         IOMUXC_GPIO_LPSR_00_LPUART12_TXD
	#define BOARD_UART_RX_PIN         IOMUXC_GPIO_LPSR_01_LPUART12_RXD
#else
	#error "Unsupported UART"
#endif

static const clock_root_t LPUART_Clock [] = 
{
	(clock_root_t)0xFFFF,	// Invalid
	kCLOCK_Root_Lpuart1,
	kCLOCK_Root_Lpuart2,
	kCLOCK_Root_Lpuart3,
	kCLOCK_Root_Lpuart4,
	kCLOCK_Root_Lpuart5,
	kCLOCK_Root_Lpuart6,
	kCLOCK_Root_Lpuart7,
	kCLOCK_Root_Lpuart8,
	kCLOCK_Root_Lpuart9,
	kCLOCK_Root_Lpuart10,
	kCLOCK_Root_Lpuart11,
	kCLOCK_Root_Lpuart12
};

#if EXAMPLE_CAN_INDEX == 1
	#define EXAMPLE_CAN CAN1
	#define BOARD_CAN_TX_PIN         IOMUXC_GPIO_AD_06_FLEXCAN1_TX
	#define BOARD_CAN_RX_PIN         IOMUXC_GPIO_AD_07_FLEXCAN1_RX
	#define BOARD_CAN_CLOCK_SOURCE   kCLOCK_Root_Can1
#elif EXAMPLE_CAN_INDEX == 2
	#define EXAMPLE_CAN CAN2
	#define BOARD_CAN_TX_PIN         IOMUXC_GPIO_AD_01_FLEXCAN2_RX
	#define BOARD_CAN_RX_PIN         IOMUXC_GPIO_AD_00_FLEXCAN2_TX
	#define BOARD_CAN_CLOCK_SOURCE   kCLOCK_Root_Can2
#elif EXAMPLE_CAN_INDEX == 3
	#define EXAMPLE_CAN CAN3
	#define BOARD_CAN_TX_PIN         IOMUXC_GPIO_LPSR_00_FLEXCAN3_TX
	#define BOARD_CAN_RX_PIN         IOMUXC_GPIO_LPSR_01_FLEXCAN3_RX
	#define BOARD_CAN_CLOCK_SOURCE   kCLOCK_Root_Can3
#else
	#error "Unsupported CAN"
#endif

#ifndef BOARD_DEBUG_UART_BAUDRATE
	#define BOARD_DEBUG_UART_BAUDRATE (115200U)
#endif /* BOARD_DEBUG_UART_BAUDRATE */

/* Definitions for eRPC MU transport layer */
#if defined(FSL_FEATURE_MU_SIDE_A)
	#define MU_BASE        MUA
	#define MU_IRQ         MUA_IRQn
	#define MU_IRQ_HANDLER MUA_IRQHandler
#endif
#if defined(FSL_FEATURE_MU_SIDE_B)
	#define MU_BASE        MUB
	#define MU_IRQ         MUB_IRQn
	#define MU_IRQ_HANDLER MUB_IRQHandler
#endif
#define MU_IRQ_PRIORITY (2)

/*! @brief The USER_LED used for board */
#define LOGIC_LED_ON  (0U)
#define LOGIC_LED_OFF (1U)
#ifndef BOARD_USER_LED_GPIO
	#define BOARD_USER_LED_GPIO GPIO9
#endif
#ifndef BOARD_USER_LED_GPIO_PIN
	#define BOARD_USER_LED_GPIO_PIN (3U)
#endif

#define USER_LED_INIT(output)                                            \
    GPIO_PinWrite(BOARD_USER_LED_GPIO, BOARD_USER_LED_GPIO_PIN, output); \
    BOARD_USER_LED_GPIO->GDIR |= (1U << BOARD_USER_LED_GPIO_PIN) /*!< Enable target USER_LED */
#define USER_LED_OFF() \
    GPIO_PortClear(BOARD_USER_LED_GPIO, 1U << BOARD_USER_LED_GPIO_PIN)                 /*!< Turn off target USER_LED */
#define USER_LED_ON() GPIO_PortSet(BOARD_USER_LED_GPIO, 1U << BOARD_USER_LED_GPIO_PIN) /*!<Turn on target USER_LED*/
#define USER_LED_TOGGLE()                                       \
    GPIO_PinWrite(BOARD_USER_LED_GPIO, BOARD_USER_LED_GPIO_PIN, \
                  0x1 ^ GPIO_PinRead(BOARD_USER_LED_GPIO, BOARD_USER_LED_GPIO_PIN)) /*!< Toggle target USER_LED */

/*! @brief Define the port interrupt number for the board switches */
#ifndef BOARD_USER_BUTTON_GPIO
	#define BOARD_USER_BUTTON_GPIO GPIO13
#endif
#ifndef BOARD_USER_BUTTON_GPIO_PIN
	#define BOARD_USER_BUTTON_GPIO_PIN (0U)
#endif
#define BOARD_USER_BUTTON_IRQ         GPIO13_Combined_0_31_IRQn
#define BOARD_USER_BUTTON_IRQ_HANDLER GPIO13_Combined_0_31_IRQHandler
#define BOARD_USER_BUTTON_NAME        "SW7"

/*! @brief The board flash size */
#define BOARD_FLASH_SIZE (0x1000000U)

/* SKIP_SEMC_INIT can also be defined independently */
#ifdef USE_SDRAM
	#define SKIP_SEMC_INIT
#endif

/*! @brief The ENET0 PHY address. */
#define BOARD_ENET0_PHY_ADDRESS (0x02U) /* Phy address of enet port 0. */

/*! @brief The ENET1 PHY address. */
#define BOARD_ENET1_PHY_ADDRESS (0x01U) /* Phy address of enet port 1. */

/*! @brief The EMVSIM SMARTCARD PHY configuration. */
#define BOARD_SMARTCARD_MODULE                (EMVSIM1)      /*!< SMARTCARD communicational module instance */
#define BOARD_SMARTCARD_MODULE_IRQ            (EMVSIM1_IRQn) /*!< SMARTCARD communicational module IRQ handler */
#define BOARD_SMARTCARD_CLOCK_MODULE_CLK_FREQ (CLOCK_GetRootClockFreq(kCLOCK_Root_Emv1))
#define BOARD_SMARTCARD_CLOCK_VALUE           (4000000U) /*!< SMARTCARD clock frequency */

/* USB PHY condfiguration */
#define BOARD_USB_PHY_D_CAL     (0x07U)
#define BOARD_USB_PHY_TXCAL45DP (0x06U)
#define BOARD_USB_PHY_TXCAL45DM (0x06U)

#define BOARD_ARDUINO_INT_IRQ   (GPIO1_INT3_IRQn)
#define BOARD_ARDUINO_I2C_IRQ   (LPI2C1_IRQn)
#define BOARD_ARDUINO_I2C_INDEX (1)

#define BOARD_HAS_SDCARD (1U)

/* @Brief Board accelerator sensor configuration */
#define BOARD_ACCEL_I2C_BASEADDR LPI2C5
/* Clock divider for LPI2C clock source */
#define BOARD_ACCEL_I2C_CLOCK_FREQ (CLOCK_GetRootClockFreq(kCLOCK_Root_Lpi2c5))

#define BOARD_CODEC_I2C_BASEADDR             LPI2C5
#define BOARD_CODEC_I2C_INSTANCE             5U
#define BOARD_CODEC_I2C_CLOCK_SOURCE_SELECT  (0U)
#define BOARD_CODEC_I2C_CLOCK_SOURCE_DIVIDER (6U)
#define BOARD_CODEC_I2C_CLOCK_FREQ           (24000000U)

/* @Brief Board CAMERA configuration */
#define BOARD_CAMERA_I2C_BASEADDR      LPI2C6
#define BOARD_CAMERA_I2C_CLOCK_ROOT    kCLOCK_Root_Lpi2c6
#define BOARD_CAMERA_I2C_CLOCK_SOURCE  (1U)  /* OSC24M. */
#define BOARD_CAMERA_I2C_CLOCK_DIVIDER (12U) /* Divider = 12, LPI2C clock frequency 2M. */

/*! @brief The MIPI panel pins. */
#define BOARD_MIPI_PANEL_RST_GPIO   GPIO9
#define BOARD_MIPI_PANEL_RST_PIN    1
#define BOARD_MIPI_PANEL_POWER_GPIO GPIO11
#define BOARD_MIPI_PANEL_POWER_PIN  16
/* Back light pin. */
#define BOARD_MIPI_PANEL_BL_GPIO GPIO9
#define BOARD_MIPI_PANEL_BL_PIN  29

/* Touch panel. */
#define BOARD_MIPI_PANEL_TOUCH_I2C_BASEADDR      LPI2C5
#define BOARD_MIPI_PANEL_TOUCH_I2C_CLOCK_ROOT    kCLOCK_Root_Lpi2c5
#define BOARD_MIPI_PANEL_TOUCH_I2C_CLOCK_SOURCE  (1U)  /* OSC24M. */
#define BOARD_MIPI_PANEL_TOUCH_I2C_CLOCK_DIVIDER (12U) /* Divider = 12, LPI2C clock frequency 2M. */
#define BOARD_MIPI_PANEL_TOUCH_I2C_CLOCK_FREQ    CLOCK_GetRootClockFreq(BOARD_MIPI_PANEL_TOUCH_I2C_CLOCK_ROOT)
#define BOARD_MIPI_PANEL_TOUCH_RST_GPIO          GPIO9
#define BOARD_MIPI_PANEL_TOUCH_RST_PIN           0
#define BOARD_MIPI_PANEL_TOUCH_INT_GPIO          GPIO8
#define BOARD_MIPI_PANEL_TOUCH_INT_PIN           31

/*! @brief The camera pins. */
#define BOARD_CAMERA_PWDN_GPIO GPIO9
#define BOARD_CAMERA_PWDN_PIN  25
#define BOARD_CAMERA_RST_GPIO  GPIO11
#define BOARD_CAMERA_RST_PIN   15

/* SD card detection method when using wifi module. */
#define BOARD_WIFI_SD_DETECT_TYPE kSDMMCHOST_DetectCardByHostDATA3

/*! @brief The Ethernet port used by network examples, default use 1G port. */
/* Below comment is for test script to easily define which port to be used, please don't delete. */
/* @TEST_ANCHOR */
#ifndef BOARD_NETWORK_USE_100M_ENET_PORT
#define BOARD_NETWORK_USE_100M_ENET_PORT (0U)
#endif

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/*******************************************************************************
 * API
 ******************************************************************************/
uint32_t BOARD_DebugConsoleSrcFreq(void);

void BOARD_InitDebugConsole(void);

void BOARD_ConfigMPU(void);
#if defined(SDK_I2C_BASED_COMPONENT_USED) && SDK_I2C_BASED_COMPONENT_USED
void BOARD_LPI2C_Init(LPI2C_Type *base, uint32_t clkSrc_Hz);
status_t BOARD_LPI2C_Send(LPI2C_Type *base,
                          uint8_t deviceAddress,
                          uint32_t subAddress,
                          uint8_t subaddressSize,
                          uint8_t *txBuff,
                          uint8_t txBuffSize);
status_t BOARD_LPI2C_Receive(LPI2C_Type *base,
                             uint8_t deviceAddress,
                             uint32_t subAddress,
                             uint8_t subaddressSize,
                             uint8_t *rxBuff,
                             uint8_t rxBuffSize);
status_t BOARD_LPI2C_SendSCCB(LPI2C_Type *base,
                              uint8_t deviceAddress,
                              uint32_t subAddress,
                              uint8_t subaddressSize,
                              uint8_t *txBuff,
                              uint8_t txBuffSize);
status_t BOARD_LPI2C_ReceiveSCCB(LPI2C_Type *base,
                                 uint8_t deviceAddress,
                                 uint32_t subAddress,
                                 uint8_t subaddressSize,
                                 uint8_t *rxBuff,
                                 uint8_t rxBuffSize);
void BOARD_Accel_I2C_Init(void);
status_t BOARD_Accel_I2C_Send(uint8_t deviceAddress, uint32_t subAddress, uint8_t subaddressSize, uint32_t txBuff);
status_t BOARD_Accel_I2C_Receive(
    uint8_t deviceAddress, uint32_t subAddress, uint8_t subaddressSize, uint8_t *rxBuff, uint8_t rxBuffSize);
void BOARD_Codec_I2C_Init(void);
status_t BOARD_Codec_I2C_Send(
    uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, const uint8_t *txBuff, uint8_t txBuffSize);
status_t BOARD_Codec_I2C_Receive(
    uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, uint8_t *rxBuff, uint8_t rxBuffSize);
void BOARD_Camera_I2C_Init(void);
status_t BOARD_Camera_I2C_Send(
    uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, const uint8_t *txBuff, uint8_t txBuffSize);
status_t BOARD_Camera_I2C_Receive(
    uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, uint8_t *rxBuff, uint8_t rxBuffSize);

status_t BOARD_Camera_I2C_SendSCCB(
    uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, const uint8_t *txBuff, uint8_t txBuffSize);
status_t BOARD_Camera_I2C_ReceiveSCCB(
    uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, uint8_t *rxBuff, uint8_t rxBuffSize);

void BOARD_MIPIPanelTouch_I2C_Init(void);
status_t BOARD_MIPIPanelTouch_I2C_Send(
    uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, const uint8_t *txBuff, uint8_t txBuffSize);
status_t BOARD_MIPIPanelTouch_I2C_Receive(
    uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, uint8_t *rxBuff, uint8_t rxBuffSize);
#endif /* SDK_I2C_BASED_COMPONENT_USED */

void BOARD_SD_Pin_Config(uint32_t speed, uint32_t strength);
void BOARD_MMC_Pin_Config(uint32_t speed, uint32_t strength);

#if defined(__cplusplus)
}
#endif /* __cplusplus */

#endif /* _BOARD_H_ */
